{
    "basic_info": {
      "description_header": "Hello",
      "description": "As a Product Manager for 7 years, I decided to train in coding after working for several years alongside talented developers. My experience with the product made me particularly sensitive to the user experience and respect for models. During my 9-month training at Openclassrooms, I was able to work on more than ten different projects, all of them very concrete: the cases I tackled could be those of a traditional company or a start-up today. I'm also curious and independent by nature, and web development is the ideal opportunity for me to learn every day and put these skills to good use.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "ArgentBank",
        "startDate": "2023",
        "description": "Argent Bank is a new online bank that aims to offer its users a practical, user-friendly dashboard. For this project, I developed a full-featured, responsive, cross-device web application using technologies such as React, React Router 6 and Protected Routes. The application includes several features, including user authentication, a dashboard and application state management with Redux. I also used Swagger to create a YAML file dedicated to transaction functionality. This will allow users to view their transactions and add, modify or delete transaction information easily",
        "images": [
          "images/portfolio/argentbank/p1.jpg",
          "images/portfolio/argentbank/p2.jpg"
        ],
        "url": "https://github.com/Elsa-san/argentbank",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Kasa",
        "startDate": "2023",
        "description": "Kasa has been in the private flat rental business for nearly 10 years. The company wanted to completely overhaul its website, which led me to use React as a framework. Reusable components were created for the opening tabs and the photo carousel. I also used Figma to convert the mock-ups into React components and routes, which enabled me to ensure visual consistency while developing an interactive and user-friendly interface.",
        "images": [
          "images/portfolio/kasa/p1.jpg",
          "images/portfolio/kasa/p2.jpg"
        ],
        "url": "https://github.com/Elsa-san/kasa",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Ohmyfood",
        "startDate": "2023",
        "description": "OhMyFood is a mobile-first website dedicated to presenting the menus offered by gourmet restaurants. As a web integrator, I was responsible for transforming the mock-ups provided by the design team into a functional, responsive website adapted to different devices such as smartphones, tablets and desktops. As part of this project, I was also tasked with integrating the animations and behaviours specified in the website prototype to provide an optimal and attractive user experience. This work experience enabled me to put Sass and my web integration skills into practice, to deliver a quality result on time and on budget."
,
        "images": [
          "images/portfolio/ohmyfood/p1.jpg",
          "images/portfolio/ohmyfood/p2.jpg"
        ],
        "url": "https://elsa-san.github.io/Ohmyfood/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-sass-original",
            "name": "SASS"
          },
            {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      },
      {
        "title": "Nina Carducci",
        "startDate": "2023",
        "description": "The goal of this project was to offer photographer Nina Carducci SEO optimisation to give her more visibility. I worked on a number of aspects to improve the SEO performance of her site, including: adding appropriate metadata for social networks, technical optimisations in terms of the site's code and structure to improve its accessibility to search engines, optimisations of images to reduce their size without compromising their quality and improvements to accessibility. I provided a full optimisation report as well as the revised code to enable Nina to implement the recommendations on these points. "
,
        "images": [
          "images/portfolio/nina/p1.jpg",
          "images/portfolio/nina/p2.jpg"
        ],
        "url": "https://elsa-san.github.io/ninacarducci/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
            {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
           {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "724events",
        "startDate": "2023",
        "description": "The goal of this project was to debug and finalise the website, which had been partially integrated by a previous developer. The site is now fully functional and ready for publication. The source code was carefully revised to resolve all the problems and bugs that were hampering the visitor experience."
,
        "images": [
          "images/portfolio/events/p1.jpg",
          "images/portfolio/events/p2.jpg"
        ],
        "url": "https://elsa-san.github.io/Ohmyfood/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
            {
            "class": "devicon-css3-plain",
            "name": "CSS"
          }
        ]
      },
      {
        "title": "Sophie Bluel",
        "startDate": "2023",
        "description": "As a web integrator, I worked on the development of the portfolio website of an interior designer, Sophie Bluel. My job was to design the front-end of the site using Javascript. I had to retrieve the architect's work from an API and integrate it into a dynamic gallery. I also designed a secure login page to allow users to access the site's administration interface. I also implemented features to allow logged-in users to delete or add jobs without having to reload the page. My work has improved the user experience and made the site more interactive."
,
        "images": [
          "images/portfolio/bluel/p1.jpg",
          "images/portfolio/bluel/p2.jpg"
        ],
        "url": "https://github.com/Elsa-san/ArchiWebos",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
            {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Openclassrooms",
        "title": "Front-End Developer",
        "years": "2023",
        "mainTech": [
          "React"
        ],
        "technologies": [
          "HTML",
          "CSS",
          "React",
          "REST API",
          "JavaScript",
          "SASS",
          "Bootstrap",
          "Redux",
          "Intégration",
          "Swagger",
          "Github",
          "Git"
        ]
      },
      {
        "company": "Wecasa",
        "title": "Product Manager",
        "years": "2017-2023",
        "mainTech": [
          "Product Management"
        ],
        "technologies": [
          "Agile Methods",
          "Scrum",
          "Kanban",
          "Figma",
          "Jira",
          "Shortcut",
          "QA"
        ]
      },
      {
        "company": "Campings.com",
        "title": "Product Manager",
        "years": "2014-2017",
        "mainTech": [
          "Product Management"
        ],
        "technologies": [
          "Agile Methods",
          "Scrum",
          "Kanban",
          "Jira",
          "QA"
        ]
      },
      {
        "company": "Hospital",
        "title": "Lawyer",
        "years": "Before 2014",
        "mainTech": [
          "Healthcare law"
        ],
        "technologies": [
          "Law"
        ]
      }
    ]
  }